In [19]:
import pandas as pd
import sqlite3
import altair as alt

con = sqlite3.connect('lahmansbaseballdb.sqlite')

#df = pd.read_sql_query("""
#SELECT * FROM fielding LIMIT 5""", con)

In [2]:
#Q1

q = '''
SELECT DISTINCT cp.playerid, cp.schoolid, sal.salary, sal.yearid,sal.teamid
FROM schools as s 
JOIN collegeplaying as cp
ON s.schoolid = cp.schoolid
JOIN salaries as sal
ON cp.playerid = sal.playerid
WHERE cp.schoolid = 'idbyuid'
ORDER BY sal.salary DESC;
'''

In [50]:
q1 = pd.read_sql_query(q,con)
q1

table1_project3 =q1.to_markdown()
print(table1_project3)

|    | playerID   | schoolID   |         salary |   yearID | teamID   |
|---:|:-----------|:-----------|---------------:|---------:|:---------|
|  0 | lindsma01  | idbyuid    |      4e+06     |     2014 | CHA      |
|  1 | lindsma01  | idbyuid    |      3.6e+06   |     2012 | BAL      |
|  2 | lindsma01  | idbyuid    |      2.8e+06   |     2011 | COL      |
|  3 | lindsma01  | idbyuid    |      2.3e+06   |     2013 | CHA      |
|  4 | lindsma01  | idbyuid    |      1.625e+06 |     2010 | HOU      |
|  5 | stephga01  | idbyuid    |      1.025e+06 |     2001 | SLN      |
|  6 | stephga01  | idbyuid    | 900000         |     2002 | SLN      |
|  7 | stephga01  | idbyuid    | 800000         |     2003 | SLN      |
|  8 | stephga01  | idbyuid    | 550000         |     2000 | SLN      |
|  9 | lindsma01  | idbyuid    | 410000         |     2009 | FLO      |
| 10 | lindsma01  | idbyuid    | 395000         |     2008 | FLO      |
| 11 | lindsma01  | idbyuid    | 380000         |     2007 | FLO      |
| 12 | stephga01  | idbyuid    | 215000         |     1999 | SLN      |
| 13 | stephga01  | idbyuid    | 185000         |     1998 | PHI      |
| 14 | stephga01  | idbyuid    | 150000         |     1997 | PHI      |

In [4]:
#Q2_a
q_2a='''
SELECT DISTINCT playerID, yearID, (cast(H as float)/AB) AS batting_average
FROM Batting
ORDER BY batting_average DESC, playerID
LIMIT 5
'''
q_2a

'\nSELECT DISTINCT playerID, yearID, (cast(H as float)/AB) AS batting_average\nFROM Batting\nORDER BY batting_average DESC, playerID\nLIMIT 5\n'

In [5]:
q2a = pd.read_sql_query(q_2a,con)
q2a

    playerID  yearID  batting_average
0   aberal01    1957              1.0
1  abernte02    1960              1.0
2  abramge01    1923              1.0
3  acklefr01    1964              1.0
4  alanirj01    2019              1.0

In [6]:
#Q2_b
q_2b='''
SELECT DISTINCT playerID, yearID, (cast(H as float)/AB) AS batting_average
FROM Batting
WHERE AB >= 10
ORDER BY batting_average DESC, playerID
LIMIT 5
'''
q2b = pd.read_sql_query(q_2b,con)
q2b

    playerID  yearID  batting_average
0  nymanny01    1974         0.642857
1  carsoma01    2013         0.636364
2  altizda01    1910         0.600000
3  johnsde01    1975         0.600000
4  silvech01    1948         0.571429

In [7]:
#Q2_c
q_2c='''
SELECT DISTINCT playerID, yearID, (SUM(cast(H as float))/SUM(AB)) AS batting_average
FROM Batting
WHERE AB >= 100
GROUP BY playerID
ORDER BY batting_average DESC, playerID
LIMIT 5
'''
q2c = pd.read_sql_query(q_2c,con)
q2c

    playerID  yearID  batting_average
0  hazlebo01    1957         0.402985
1  daviscu01    1939         0.380952
2  fishesh01    1930         0.374016
3  woltery01    1871         0.369565
4   cobbty01    1905         0.366299

In [35]:
#Question 3
q3 = '''
SELECT DISTINCT teamID, SUM(W) AS Wins, name
FROM Teams
WHERE name = "Miami Marlins";
'''

q_3 = pd.read_sql_query(q3,con)
q_3

  teamID  Wins           name
0    MIA   555  Miami Marlins

In [42]:
q3b = '''
SELECT DISTINCT teamID, SUM(W) AS Wins, name
FROM Teams
WHERE name = "Minnesota Twins";
'''

q_3b = pd.read_sql_query(q3b,con)
q_3b

  teamID  Wins             name
0    MIN  4680  Minnesota Twins

In [47]:
chart1 =plot=alt.Chart(q_3).mark_bar(color = "red").encode(
    alt.X('name'),
    alt.Y('Wins'),
)
plot.properties(title='Number of Wins by Team')

chart2 =plot=alt.Chart(q_3b).mark_bar(color = "blue").encode(
    alt.X('name'),
    alt.Y('Wins'),
)
plot.properties(title='Number of Wins by Team')

chart = chart1 + chart2
chart.save("project3_chart.png")